{"data":{"post":{"title":"How to manage AMI sets","slug":"how-to-manage-ami-sets","datetime":"2016-07-22 14:30:43","content":"<p>After finishing the first version of the <a href=\"http://anarute.com/the-amiset-entity/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">AMI sets entity</a>, now we need to be able to manage them.</p>\n<p>Taskcluster has already a set of tools to manage its components and elements: the <a href=\"https://tools.taskcluster.net/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">taskcluster tools</a>. In order to manage the AMI sets it was natural to build a tool for that. At first, our main goal is to build a minimal tool that allows us to list all the AMI sets known to the AWS provisioner and to add, edit and delete AMI sets.</p>\n<p>The final shape of an AMI set is this:</p>\n<pre>\"amis\": \n  [\n    {\n      \"region\": \"us-west-1\",\n      \"hvm\": \"ami-111\",\n      \"pv\": \"ami-222\"\n    }\n  ]\n</pre>\n<p>The ideal way to manage this is to allow the user to edit each field separately and check if the AMIs are valid automatically, but for now we are editing it as a JSON object since the back end already checks if the data is valid.</p>\n<p>The taskcluster tools are built with <a href=\"https://facebook.github.io/react/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">React</a> and before this project I have never built anything with it. So to start, there's no better way than compare how all the other tools are built. I knew that I needed to figure out how to list the amiSets and how to embed a code editor to be used to edit and create amiSets, so my main examples were the <a href=\"https://tools.taskcluster.net/auth/roles/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Roles tool</a> and the text editor from <a href=\"https://tools.taskcluster.net/task-creator/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Task Creator tool</a>. The editor used in taskcluster tools is <a href=\"http://codemirror.net/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">CodeMirror,</a> a text editor built in javascript for the browser.</p>\n<p>My first step was to build the add amiSet function - after all, without amiSets I cannot test any other endpoint. I started to see progress when apparently no errors showed up when trying to add an amiSet, but to check if it really worked I needed the listing function, then the view function. After making this work, edit and delete were the final ones. A <a href=\"https://github.com/taskcluster/taskcluster-tools/pull/121\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">first version</a> is already being reviewed and hopefully it will be published soon. We still have a lot of improvements to make but it seems good enough to move forward and start to incorporate the amiSets in the AWS provisioner architecture.</p>\n<p>Even after testing the AMI sets entity endpoints in the back end, I wasn't sure if it was really working because I could only see that it passed the tests that I have built, but I couldn't really see the amiSets (<em>and I must say I'm a very visual person</em>) but now with the tool I finally can see them, and it is grateful to see that what you're doing is working! - until it breaks something, of course.</p>\n","description":"","timeToRead":2,"cover":"","fullscreen":false,"author":{"id":"anarute","title":"anarute","path":"/author/anarute"},"tags":[{"id":"outreachy","title":"outreachy","path":"/tag/outreachy"},{"id":"FOSS","title":"FOSS","path":"/tag/FOSS"},{"id":"taskcluster","title":"taskcluster","path":"/tag/taskcluster"},{"id":"Mozilla","title":"Mozilla","path":"/tag/Mozilla"}]}},"context":{}}